d6k/trunk/src/web/server/SOAP.PublishEvent.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns2="http://iec.ch/TC57/2011/schema/message"
  xmlns:ns1="http://iec.ch/TC57/2011/abstract">
 <SOAP-ENV:Body>
   <ns2:EventMessage>
    <Header>
     <Verb>cancel</Verb>
     <Noun></Noun>
     <Revision></Revision>
     <ReplayDetection>
      <Nonce></Nonce>
      <Created>2015-07-08T09:17:54Z</Created>
     </ReplayDetection>
     <Context></Context>
     <Timestamp>2015-07-08T09:17:54Z</Timestamp>
     <Source></Source>
     <AsyncReplyFlag>false</AsyncReplyFlag>
     <ReplyAddress></ReplyAddress>
     <AckRequired>false</AckRequired>
     <User>
      <UserID></UserID>
      <Organization></Organization>
     </User>
     <MessageID></MessageID>
     <CorrelationID></CorrelationID>
     <Comment></Comment>
     <Property>
      <Name></Name>
      <Value></Value>
     </Property>
     <Property>
      <Name></Name>
      <Value></Value>
     </Property>


    </Header>
    <Payload>

     <Format></Format>
    </Payload>
   </ns2:EventMessage>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
